cppProj/auto_reg/fio_rand_write.log
AutoREG: (g=0): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=32
...
AutoREG: (g=0): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=32
fio-2.1.3
Starting 4 processes

AutoREG: (groupid=0, jobs=4): err= 0: pid=2065: Fri Feb  5 14:17:39 2016
  write: io=7729.0MB, bw=131891KB/s, iops=32972, runt= 60008msec
    slat (usec): min=1, max=352, avg= 2.08, stdev= 1.16
    clat (usec): min=104, max=1209.1K, avg=3878.25, stdev=16019.78
     lat (usec): min=117, max=1209.1K, avg=3880.41, stdev=16019.82
    clat percentiles (usec):
     |  1.00th=[  219],  5.00th=[  255], 10.00th=[  486], 20.00th=[  636],
     | 30.00th=[  868], 40.00th=[  972], 50.00th=[ 2256], 60.00th=[ 2576],
     | 70.00th=[ 3728], 80.00th=[ 6240], 90.00th=[ 8640], 95.00th=[10048],
     | 99.00th=[22656], 99.50th=[38144], 99.90th=[138240], 99.95th=[234496],
     | 99.99th=[995328]
    bw (KB  /s): min= 4417, max=143096, per=25.47%, avg=33597.00, stdev=28267.31
    lat (usec) : 250=4.73%, 500=6.02%, 750=13.20%, 1000=19.72%
    lat (msec) : 2=4.24%, 4=24.25%, 10=23.19%, 20=3.49%, 50=0.84%
    lat (msec) : 100=0.20%, 250=0.09%, 500=0.03%, 750=0.01%, 1000=0.01%
    lat (msec) : 2000=0.01%
  cpu          : usr=2.54%, sys=2.71%, ctx=1947700, majf=0, minf=36
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=1978624/d=0, short=r=0/w=0/d=0

Run status group 0 (all jobs):
  WRITE: io=7729.0MB, aggrb=131890KB/s, minb=131890KB/s, maxb=131890KB/s, mint=60008msec, maxt=60008msec

Disk stats (read/write):
  nvme0n1: ios=73/1976846, merge=0/0, ticks=16/7657944, in_queue=7664436, util=99.93%