cppProj/auto_reg/fio_seq_write.log
AutoREG: (g=0): rw=write, bs=64K-64K/64K-64K/64K-64K, ioengine=libaio, iodepth=32
...
AutoREG: (g=0): rw=write, bs=64K-64K/64K-64K/64K-64K, ioengine=libaio, iodepth=32
fio-2.1.3
Starting 4 processes

AutoREG: (groupid=0, jobs=4): err= 0: pid=1938: Fri Feb  5 14:16:39 2016
  write: io=15704MB, bw=267847KB/s, iops=4185, runt= 60036msec
    slat (usec): min=2, max=1879, avg= 5.62, stdev= 4.30
    clat (usec): min=125, max=3476.1K, avg=30561.47, stdev=52547.79
     lat (usec): min=154, max=3476.2K, avg=30567.25, stdev=52548.03
    clat percentiles (msec):
     |  1.00th=[   12],  5.00th=[   13], 10.00th=[   15], 20.00th=[   17],
     | 30.00th=[   19], 40.00th=[   22], 50.00th=[   25], 60.00th=[   26],
     | 70.00th=[   29], 80.00th=[   36], 90.00th=[   48], 95.00th=[   62],
     | 99.00th=[  135], 99.50th=[  198], 99.90th=[  717], 99.95th=[  947],
     | 99.99th=[ 1942]
    bw (KB  /s): min=13105, max=119057, per=25.06%, avg=67121.33, stdev=18223.51
    lat (usec) : 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
    lat (msec) : 2=0.01%, 4=0.01%, 10=0.11%, 20=37.24%, 50=53.79%
    lat (msec) : 100=7.20%, 250=1.25%, 500=0.19%, 750=0.11%, 1000=0.05%
    lat (msec) : 2000=0.03%, >=2000=0.01%
  cpu          : usr=2.08%, sys=0.88%, ctx=251042, majf=0, minf=41
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=251257/d=0, short=r=0/w=0/d=0

Run status group 0 (all jobs):
  WRITE: io=15704MB, aggrb=267846KB/s, minb=267846KB/s, maxb=267846KB/s, mint=60036msec, maxt=60036msec

Disk stats (read/write):
  nvme0n1: ios=0/251083, merge=0/0, ticks=0/7647932, in_queue=7664112, util=99.90%